<?php
    header("Content-type:text/html;charset=utf-8");
    //获取数据
    $pageIndex=$_GET['pageIndex'];
    if($pageIndex==1){
        echo "这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>这是第一部分内容，您先慢慢享用<br/>";

    }else if($pageIndex==2){
        echo "这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>这是剩下的内容，你继续享用<br/>";
    }
?>